[
  {
    "name": "Avengers Age of Ultron",
    "productionCompany": "Marvel",
    "description": "Marvel's second edition of Avengers franchise",
    "country": "United States",
    "genres": [
      "Sci-fi",
      "Action",
      "Adventure"
    ],
    "likesCount": 1000000,
    "releaseYear": 2015
  },
  {
    "name": "Avengers Inifinity war",
    "productionCompany": "Marvel",
    "description": "Marvel's third edition of Avengers franchise",
    "country": "United States",
    "genres": [
      "Sci-fi",
      "Action",
      "Adventure"
    ],
    "likesCount": 31312312312,
    "releaseYear": 2018
  },
  {
    "name": "Seven",
    "productionCompany": "Cecchi Gori Pictures",
    "description": "Seven (stylized as SE7EN) is a 1995 American neo-noir crime thriller film directed by David Fincher and written by Andrew Kevin Walker",
    "country": "United States",
    "genres": [
      "Crime"
    ],
    "likesCount": 4141412,
    "releaseYear": 1995
  },
  {
    "name": "No Country for Old Men",
    "productionCompany": "Scott Rudin Productions",
    "description": "No Country for Old Men is a 2007 American crime thriller film written and directed by Joel and Ethan Coen, based on Cormac McCarthy's 2005 novel of the same name",
    "country": "United States",
    "genres": [
      "Crime"
    ],
    "likesCount": 31313312,
    "releaseYear": 2007
  },
  {
    "name": "The Departed",
    "productionCompany": "Warner Bros",
    "description": "The Departed is a 2006 American crime drama film directed by Martin Scorsese and written by William Monahan. It is a remake of the 2002 Hong Kong film Infernal Affairs",
    "country": "United States",
    "genres": [
      "Crime"
    ],
    "likesCount": 552355235,
    "releaseYear": 2006
  },
  {
    "name": "The Silence of the Lambs",
    "productionCompany": "Strong Heart/Demme Production",
    "description": "The Silence of the Lambs is a 1991 American psychological horror-thriller film directed by Jonathan Demme from a screenplay written by Ted Tally, adapted from Thomas Harris's 1988 novel of the same name",
    "country": "United States",
    "genres": [
      "Crime"
    ],
    "likesCount": 3131234234,
    "releaseYear": 1991
  },
  {
    "name": "L.A. Confidential",
    "productionCompany": "The Wolper Organization",
    "description": "L.A. Confidential is a 1997 American neo-noir crime film directed, produced and co-written by Curtis Hanson. The screenplay by Hanson and Brian Helgeland is based on James Ellroy's 1990 novel of the same name, the third book in his L.A. Quartet series",
    "country": "United States",
    "genres": [
      "Crime"
    ],
    "likesCount": 242424242,
    "releaseYear": 1997
  },
  {
    "name": "New World",
    "productionCompany": "Next Entertainment World",
    "description": "New World (Hangul: 신세계; RR: Sinsegye) is a 2013 South Korean crime drama film written and directed by Park Hoon-jung. Starring Choi Min-sik, Hwang Jung-min and Lee Jung-jae, the film is a melodrama revolving around an undercover cop who finds it difficult to play both a cop and a goon.New World is the first entry in a planned trilogy.",
    "country": "South Korea",
    "genres": [
      "Crime"
    ],
    "likesCount": 242424242,
    "releaseYear": 2013
  },
  {
    "name": "I Saw the Devil",
    "productionCompany": "Mediaplex",
    "description": "I Saw the Devil (Hangul: 악마를 보았다; Hanja: 惡魔를 보았다; RR: Akmareul boatda) is a 2010 South Korean action[3] horror thriller film directed by Kim Jee-woon,[4] and written by Jee-woon and Park Hoon-jung. Starring Lee Byung-hun and Choi Min-sik, the film follows NIS agent Kim Soo-hyun (Byung-hun), who embarks on a quest of revenge when his fiancée is brutally murdered by a psychopathic murderer, Jang Kyung-chul (Min-sik).",
    "country": "South Korea",
    "genres": [
      "Action",
      "Horror",
      "Thriller"
    ],
    "likesCount": 663463636,
    "releaseYear": 2010
  },
  {
    "name": "The Man from Nowhere",
    "productionCompany": "CJ Entertainment",
    "description": "The Man from Nowhere (Hangul: 아저씨; RR: Ajeossi) (English: Mister) is a South Korean action thriller film starring Won Bin and written and directed by Lee Jeong-beom. It was South Korea's highest grossing film in 2010 and had 6.2 million admissions.[2] The film was released in the United States and Canada on October 1, 2010.",
    "country": "South Korea",
    "genres": [
      "Action",
      "Thriller"
    ],
    "likesCount": 4242423434,
    "releaseYear": 2010
  },
  {
    "name": "Memories of Murder",
    "productionCompany": "CJ Entertainment",
    "description": "Memories of Murder (Hangul: 살인의 추억; RR: Salinui chueok) is a 2003 South Korean crime-drama film co-written and directed by Bong Joon-ho. It is based on the true story of Korea's first serial murders in history, which took place between 1986 and 1991 in Hwaseong, Gyeonggi Province. Song Kang-ho and Kim Sang-kyung star as Detective Park and Detective Seo, respectively, two of the detectives trying to solve the crimes.",
    "country": "South Korea",
    "genres": [
      "Action",
      "Thriller"
    ],
    "likesCount": 994994141241,
    "releaseYear": 2003
  },
  {
    "name": "The Merciless",
    "productionCompany": "CJ Entertainment",
    "description": "The Merciless is a 2017 South Korean crime-action film directed by Byun Sung-hyun, and starring Sol Kyung-gu and Im Si-wan. The film was released in South Korea on May 17, 2017. It was shown out of competition in the Midnight Screenings section at the 70th Cannes Film Festival on May 24, 2017.",
    "country": "South Korea",
    "genres": [
      "Action",
      "Crime"
    ],
    "likesCount": 44424242424,
    "releaseYear": 2017
  },
  {
    "name": "Lady Vengeance",
    "productionCompany": "CJ Entertainment",
    "description": "Lady Vengeance (Hangul: 친절한 금자씨; RR: Chinjeolhan geumjassi; lit. \"Kind-hearted Geum-ja\"; titled Sympathy for Lady Vengeance in Australia) is a 2005 South Korean psychological thriller film by director Park Chan-wook.[3] The film is the third installment in Park's The Vengeance Trilogy, following Sympathy for Mr. Vengeance (2002) and Oldboy (2003). It stars Lee Young-ae as Lee Geum-ja, a woman released from prison after serving the sentence for a murder she did not commit. The film tells her story of revenge against the real murderer.",
    "country": "South Korea",
    "genres": [
      "Thriller"
    ],
    "likesCount": 44424242424,
    "releaseYear": 2005
  },
  {
    "name": "Love Actually",
    "productionCompany": "StudioCanal",
    "description": "Love Actually is a 2003 Christmas-themed romantic comedy film written and directed by Richard Curtis. It features an ensemble cast, many of whom had worked with Curtis in previous film and television projects. The screenplay delves into different aspects of love as shown through ten separate stories involving a wide variety of individuals, many of which are shown to be interlinked as the tales progress. Most of the film was filmed on location in London. The story begins five weeks before Christmas and is played out in a weekly countdown until the holiday, followed by an epilogue that takes place one month later.",
    "country": "France",
    "genres": [
      "Romance"
    ],
    "likesCount": 313131311,
    "releaseYear": 2003
  },
  {
    "name": "10 Things I Hate About You",
    "productionCompany": "Touchstone Pictures",
    "description": "10 Things I Hate About You is a 1999 American teen romantic comedy-drama film directed by Gil Junger and starring Julia Stiles, Heath Ledger, Joseph Gordon-Levitt, and Larisa Oleynik. The screenplay, written by Karen McCullah and Kirsten Smith, is a loose modernization of William Shakespeare's late-16th century comedy The Taming of the Shrew, retold in a late-1990s American high school setting. In the story, new student Cameron (Gordon-Levitt) is smitten with Bianca Stratford (Oleynik) and, in order to get around her father's strict rules on dating, attempts to get bad boy Patrick (Ledger) to date Bianca's ill-tempered sister, Kat Stratford (Stiles). The film is titled after a poem written by Kat about her bittersweet romance with Patrick. Much of the filming took place in the Seattle metropolitan area, with many scenes shot at Stadium High School in Tacoma.",
    "country": "United States",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "likesCount": 131231313,
    "releaseYear": 1999
  },
  {
    "name": "Bridget Jones's Diary",
    "productionCompany": "Universal Pictures",
    "description": "Bridget Jones's Diary is a 2001 romantic comedy film directed by Sharon Maguire and written by Richard Curtis, Andrew Davies, and Helen Fielding. It is based on Fielding's 1996 novel of the same name, which is a reinterpretation of Jane Austen's Pride and Prejudice.",
    "country": "United States",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "likesCount": 131231313,
    "releaseYear": 2010
  },
  {
    "name": "How to Lose a Guy in 10 Days",
    "productionCompany": "Paramount Pictures",
    "description": "How to Lose a Guy in 10 Days is a 2003 romantic comedy film directed by Donald Petrie, starring Kate Hudson and Matthew McConaughey. It is based on a short cartoon book of the same name by Michele Alexander and Jeannie Long..",
    "country": "United States",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "likesCount": 1313131313,
    "releaseYear": 2003
  },
  {
    "name": "Silver Linings Playbook",
    "productionCompany": "The Weinstein Company",
    "description": "Silver Linings Playbook is a 2012 American romantic comedy-drama film written and directed by David O. Russell. It was adapted from Matthew Quick’s 2008 novel The Silver Linings Playbook. The film stars Bradley Cooper and Jennifer Lawrence, with Robert De Niro, Jacki Weaver, Chris Tucker, Anupam Kher, and Julia Stiles in supporting roles.",
    "country": "United States",
    "genres": [
      "Drama",
      "Comedy"
    ],
    "likesCount": 6634634634,
    "releaseYear": 2012
  },
  {
    "name": "Be with You",
    "productionCompany": "Lotte Entertainment",
    "description": "Be with You (Hangul: 지금 만나러 갑니다; RR: Jigeum Mannareo Gamnida) is a 2018 South Korean romance film starring So Ji-sub and Son Ye-jin, and directed by Lee Jang-hoon. The film is a remake of the 2004 Japanese film of the same name, which is based on a novel by Takuji Ichikawa.",
    "country": "South Korea",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "likesCount": 414141414,
    "releaseYear": 2018
  },
  {
    "name": "My Sassy Girl",
    "productionCompany": "ShinCine Communications",
    "description": "My Sassy Girl (Korean: 엽기적인 그녀; literally, That Bizarre Girl) is a 2001 South Korean romantic comedy film directed by Kwak Jae-yong, starring Jun Ji-hyun and Cha Tae-hyun. The film is based on a true story told in a series of blog posts written by Kim Ho-sik, who later adapted them into a fictional novel.",
    "country": "South Korea",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "likesCount": 88484584858,
    "releaseYear": 2001
  },
  {
    "name": "200 Pounds Beauty",
    "productionCompany": "Showbox",
    "description": "200 Pounds Beauty (Hangul: 미녀는 괴로워; RR: Minyeoneun Goerowo; “Beauty is pain”) is a 2006 South Korean romantic comedy musical film written and directed by Kim Yong-hwa.[2] It is based on the Japanese manga Kanna's Big Success! (カンナさん大成功です! Kanna-san Daiseikou Desu!) by Yumiko Suzuki about an overweight ghost singer who undergoes intensive plastic surgery to become a pop sensation.",
    "country": "South Korea",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "likesCount": 23523525235,
    "releaseYear": 2001
  },
  {
    "name": "More than Blue",
    "productionCompany": "Showbox",
    "description": "More Than Blue (Hangul: 슬픔보다 더 슬픈 이야기; RR: Seulpeumboda Deo Seulpeun Iyagi; MR: Sŭlp‘ŭmpoda tŏ sŭlp‘ŭn iyagi) is a 2009 South Korean film. The directorial debut of poet Won Tae-yeon, it stars Kwon Sang-woo, Lee Bo-young and Lee Beom-soo in the lead roles. The film's Korean title translates as \"A Story Sadder Than Sadness.",
    "country": "South Korea",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "likesCount": 2352352525,
    "releaseYear": 2009
  },
  {
    "name": "The Classic",
    "productionCompany": "Cinema Service",
    "description": "The Classic (Hangul: 클래식; RR: Keullaeshik) is a 2003 South Korean romance melodrama film directed by Kwak Jae-yong.",
    "country": "South Korea",
    "genres": [
      "Romance",
      "Drama"
    ],
    "likesCount": 2352352525,
    "releaseYear": 2009
  },
  {
    "name": "My Little Bird",
    "productionCompany": "Korea Pictures",
    "description": "My Little Bride (Hangul: 어린 신부; RR: Eorin sinbu) is a 2004 South Korean romantic comedy film about an arranged marriage between a female high school student (Moon Geun-young) and a male college student (Kim Rae-won).[1][2] With 3,149,500 tickets sold, it was the second most popular domestic film at the Korean box office in 2004 (behind blockbuster Taegukgi), and fourth most popular overall.",
    "country": "South Korea",
    "genres": [
      "Romance",
      "Drama",
      "War"
    ],
    "likesCount": 3123131312,
    "releaseYear": 2009
  },
  {
    "name": "Penny Pinchers",
    "productionCompany": "Filament Pictures",
    "description": "Penny Pinchers (Hangul: 티끌모아 로맨스; RR: Tikkeulmoa Romaenseu; lit. \"Penny-Pinching Romance\" or \"Saving Up for Romance\") is a 2011 South Korean romantic comedy film written and directed Kim Jung-hwan, starring Han Ye-seul and Song Joong-ki.",
    "country": "South Korea",
    "genres": [
      "Romance"
    ],
    "likesCount": 75747474,
    "releaseYear": 2011
  },
  {
    "name": "Finding Mr. Destiny",
    "productionCompany": "CJ Entertainment",
    "description": "Finding Mr. Destiny (Hangul: 김종욱 찾기; RR: Kim Jong-uk chat-gi; MR: Kim Jongok ch‘atki; lit. Finding Kim Jong-wook) is a 2010 South Korean romantic comedy starring Im Soo-jung and Gong Yoo.",
    "country": "South Korea",
    "genres": [
      "Romance",
      "Comedy"
    ],
    "likesCount": 42423423344,
    "releaseYear": 2011
  },
  {
    "name": "My Wife Is a Gangster",
    "productionCompany": "CJ Entertainment",
    "description": "My Wife Is a Gangster (Hangul: 조폭 마누라; RR: Jopok Manura) is a 2001 South Korean film directed by Jo Jin-kyu; it's about a female gang boss who needs to get married to fulfill her dying sister's wishes. A sequel, My Wife Is a Gangster 2, was released in 2003, with a third (My Wife Is a Gangster 3) released at the end of 2006.",
    "country": "South Korea",
    "genres": [
      "Romance",
      "Comedy",
      "Action"
    ],
    "likesCount": 423423423,
    "releaseYear": 2011
  },
  {
    "name": "My Girlfriend Is an Agent",
    "productionCompany": "Lotte Entertainment",
    "description": "My Girlfriend Is An Agent (Hangul: 7급 공무원; lit. \"7th Level Civil Servant\") is a 2009 South Korean romantic action comedy film directed by Shin Tae-ra and starring Kim Ha-neul and Kang Ji-hwan. The film had 4,078,293 admissions nationwide and was the 4th most attended film of the year.",
    "country": "South Korea",
    "genres": [
      "Romance",
      "Comedy",
      "Action"
    ],
    "likesCount": 23424244,
    "releaseYear": 2011
  },
  {
    "name": "Hot Fuzz",
    "productionCompany": "Lotte Entertainment",
    "description": "Hot Fuzz is a 2007 buddy cop action comedy film directed by Edgar Wright, written by Wright and Simon Pegg, and starring Pegg and Nick Frost. The three and the film's producer Nira Park had previously worked together on the television series Spaced and the 2004 film Shaun of the Dead.[5] Pegg and Frost play police officers attempting to solve a series of mysterious deaths in Sandford, a village in the West Country..",
    "country": "South Korea",
    "genres": [
      "Romance",
      "Comedy",
      "Action"
    ],
    "likesCount": 423423423,
    "releaseYear": 2011
  },
  {
    "name": "Looper",
    "productionCompany": "Endgame Entertainment",
    "description": "Looper is a 2012 American science fiction thriller film written and directed by Rian Johnson, and produced by Ram Bergman and James D. Stern. It stars Bruce Willis, Joseph Gordon-Levitt, and Emily Blunt. It revolves around \"present-day\" contract killers called \"loopers\" hired by criminal syndicates from the future to terminate victims that they send back through time.",
    "country": "United States",
    "genres": [
      "Action"
    ],
    "likesCount": 223423423,
    "releaseYear": 2012
  },
  {
    "name": "Kung Fu Hustle",
    "productionCompany": "Star Overseas",
    "description": "Kung Fu Hustle is a 2004 martial arts gangster comedy film, directed, produced and written by Stephen Chow, who also stars in the lead role. The other producers were Chui Po-chu and Jeffrey Lau, and the screenplay was co-written with Huo Xin, Chan Man-keung, and Tsang Kan-cheung. Yuen Wah, Yuen Qiu, Danny Chan Kwok-kwan, and Bruce Leung Siu-lung co-starred in prominent roles.",
    "country": "Hong Kong",
    "genres": [
      "Action",
      "Comedy",
      "Gangster"
    ],
    "likesCount": 323423423,
    "releaseYear": 2004
  },
  {
    "name": "Wolf Warrior 2",
    "productionCompany": "Deng Feng International Media",
    "description": "Wolf Warrior 2 (Chinese: 战狼2) is a 2017 Chinese action film directed by Wu Jing, who also starred in the lead role. The film co-stars Celina Jade, Frank Grillo, Hans Zhang, and Wu Gang. The film is a sequel to 2015's Wolf Warrior. It was released in China on 27 July 2017.[2][7] The film tells a story of a loose cannon Chinese soldier named Leng Feng who takes on special missions around the world. In this sequel, he finds himself in an African country protecting medical aid workers from local rebels and vicious arms dealers.",
    "country": "China",
    "genres": [
      "Action"
    ],
    "likesCount": 23423423,
    "releaseYear": 2017
  },
  {
    "name": "Monkey King",
    "productionCompany": "Filmko Entertainment",
    "description": "The Monkey King is a 2014 Hongkonger[1]-Chinese[3] action-fantasy film directed by Cheang Pou-soi and starring Donnie Yen as the titular protagonist. Yen also serves as the film's action director. Production began in Beijing on 18 October 2010[5] and was filmed in 3D.[6] The plot is based on an episode of Journey to the West, a Chinese literary classic written in the Ming Dynasty by Wu Cheng'en. It was released on 31 January 2014.[7] A sequel titled The Monkey King 2 was released in February 2016",
    "country": "Hong Kong",
    "genres": [
      "Action",
      "History"
    ],
    "likesCount": 113423423,
    "releaseYear": 2014
  },
  {
    "name": "Fearless",
    "productionCompany": "China Filmgroup",
    "description": "Fearless, also known as Huo Yuanjia (霍元甲) in Chinese, and as Jet Li's Fearless in the United Kingdom and in the United States, is a 2006 Chinese-Hong Kong martial arts film directed by Ronny Yu and starring Jet Li. It is loosely based on the life of Huo Yuanjia, a Chinese martial artist who challenged foreign fighters in highly publicized events, restoring pride and nationalism to China at a time when Western imperialism and Japanese manipulation were eroding the country in the final years of the Qing Dynasty before the birth of the Republic of China. Li stated in an interview that the film was his last wushu martial arts epic, a point also made in the film's television promotions and other publicity.",
    "country": "China",
    "genres": [
      "Action",
      "History"
    ],
    "likesCount": 1123423,
    "releaseYear": 2006
  },
  {
    "name": "IP man 2",
    "productionCompany": "Mandarin Films",
    "description": "Ip Man 2 (also known as Ip Man 2: Legend of the Grandmaster) is a 2010 Hong Kong biographical martial arts film loosely based on the life of Ip Man, a grandmaster of the martial art Wing Chun. A sequel to the 2008 film Ip Man, Ip Man 2 was directed by Wilson Yip and stars Donnie Yen, who reprises the leading role. Continuing after the events of the earlier film, the sequel centers on Ip's movements in British Hong Kong. He attempts to propagate his discipline of Wing Chun, but faces rivalry from other practitioners, including the local master of Hung Ga martial arts.",
    "country": "Hong Kong",
    "genres": [
      "Action",
      "History"
    ],
    "likesCount": 1123123423,
    "releaseYear": 2010
  },
  {
    "name": "Red Cliff",
    "productionCompany": "Beijing Film Studio",
    "description": "Red Cliff or Chibi (Chinese: 赤壁) is a 2008-09 Chinese epic war film, based on the Battle of Red Cliffs (AD 208–209) and the events at the end of the Han dynasty and immediately prior to the Three Kingdoms period in imperial China. The film was directed by John Woo, and stars Tony Leung, Takeshi Kaneshiro, Zhang Fengyi, Chang Chen, Zhao Wei, Hu Jun, and Lin Chi-ling. It is Woo's first major film since 2003's Paycheck[7] and his first Chinese-language feature since 1992's Hard Boiled,[8] also starring Leung.",
    "country": "China",
    "genres": [
      "Action",
      "History",
      "War"
    ],
    "likesCount": 3123423,
    "releaseYear": 2008
  },
  {
    "name": "Shaolin",
    "productionCompany": "Beijing Film Studio",
    "description": "Shaolin (also known as The New Shaolin Temple) is a 2011 Hong Kong-Chinese action martial arts film produced and directed by Benny Chan, and starring Andy Lau and Nicholas Tse with a special appearance by Jackie Chan.",
    "country": "China",
    "genres": [
      "Action",
      "Thriller"
    ],
    "likesCount": 31123423,
    "releaseYear": 2011
  },
  {
    "name": "The Forbidden Kingdom",
    "productionCompany": "Casey Silver Productions",
    "description": "The Forbidden Kingdom (Chinese: 功夫之王: Gong Fu Zhi Wang (Mandarin) or Gung Fu Ji Wong (Cantonese) and translated King of Kung Fu (English); Working title: The J & J Project[5]) is a 2008 Chinese-American fantasy kung fu wuxia film written by John Fusco, and directed by Rob Minkoff, and starring Jackie Chan and Jet Li. Loosely based on the novel Journey to the West, it is the first film to co-star Jackie Chan and Jet Li. The action sequences were choreographed by Yuen Woo-ping.",
    "country": "China",
    "genres": [
      "Action",
      "Adventure",
      "History"
    ],
    "likesCount": 311234211,
    "releaseYear": 2008
  },
  {
    "name": "Hero",
    "productionCompany": "Elite Group Enterprises",
    "description": "Hero is a 2002 Chinese wuxia film directed by Zhang Yimou.[2] Starring Jet Li as the nameless protagonist, the film is based on the story of Jing Ke's assassination attempt on the King of Qin in 227 BC.",
    "country": "China",
    "genres": [
      "Action",
      "History"
    ],
    "likesCount": 101234211,
    "releaseYear": 2002
  },
  {
    "name": "The Grand Master",
    "productionCompany": "Block 2 Pictures",
    "description": "The Grandmaster is a 2013 Hong Kong-Chinese martial arts drama film based on the life story of the Wing Chun grandmaster Ip Man.[1][4] The film was directed and written by Wong Kar-wai and stars Tony Leung as Ip Man. It was released on 8 January 2013 in China. It was the opening film at the 63rd Berlin International Film Festival in February 2013.[5] The film was selected as part of the 2013 Hong Kong International Film Festival.[6] The Weinstein Company acquired the international distribution rights for the film.[7] The film was selected as the Hong Kong entry for the Best Foreign Language Film at the 86th Academy Awards,[8] making the January shortlist, but did not get the nomination.[9] The film was nominated for Best Cinematography (Philippe Le Sourd) and Best Costume Design (William Chang Suk Ping) at the 86th Academy Awards.[10][11]",
    "country": "Hong Kong",
    "genres": [
      "Action",
      "History"
    ],
    "likesCount": 31123411,
    "releaseYear": 2013
  },
  {
    "name": "The Assassin",
    "productionCompany": "China Dream Film Culture Industry",
    "description": "The Assassin (Chinese: 刺客聶隱娘; pinyin: Cìkè Niè Yǐnniáng; or: The Assassin Niè Yǐnniáng) is a 2015 wuxia film directed by Taiwanese director Hou Hsiao-hsien. A Taiwan/Mainland China/Hong Kong co-production,[3][7] it was an official selection in the main competition section at the 2015 Cannes Film Festival. At Cannes, Hou won the award for Best Director.[10][11] It was released in Mainland and Hong Kong, China on 27 August, and a day later in Taiwan on 28 August 2015. It was selected as the Taiwanese entry for the Best Foreign Language Film at the 88th Academy Awards but it was not nominated.",
    "country": "China",
    "genres": [
      "Action",
      "Thriller",
      "History"
    ],
    "likesCount": 2111234211,
    "releaseYear": 2015
  },
  {
    "name": "Shaolin Soccer",
    "productionCompany": "Star Overseas Ltd",
    "description": "Shaolin Soccer (Cantonese: 少林足球) is a 2001 Hong Kong sports martial arts comedy film directed by Stephen Chow, who also stars in the lead role. A former Shaolin monk reunites his five brothers, years after their master's death, to apply their superhuman martial arts skills to play football and bring Shaolin kung fu to the masses.",
    "country": "Hong Kong",
    "genres": [
      "Sport",
      "Comedy"
    ],
    "likesCount": 411234211,
    "releaseYear": 2001
  },
  {
    "name": "Detective Dee: The Four Heavenly Kings",
    "productionCompany": "Huayi Brothers",
    "description": "Detective Dee: The Four Heavenly Kings (Mandarin: 狄仁杰之四大天王) is a 2018 Chinese action-adventure fantasy mystery film directed and produced by Tsui Hark, and the third film in his Detective Dee film series. Despite dropping the \"Young Detective Dee\" title, it is a sequel to 2013's Young Detective Dee: Rise of the Sea Dragon, and as such similarly acts as a prequel to the first installment, Mystery of the Phantom Flame.",
    "country": "China",
    "genres": [
      "Action",
      "Adventure",
      "Mystery"
    ],
    "likesCount": 2211234211,
    "releaseYear": 2018
  },
  {
    "name": "Kung Fu Jungle",
    "productionCompany": "Casey Silver Productions",
    "description": "Kung Fu Jungle, also known as Kung Fu Killer and Last of the Best, is a 2014 Hong Kong-Chinese action thriller film directed by Teddy Chan and starring Donnie Yen, Wang Baoqiang, Charlie Yeung and Michelle Bai. The film premiered at the 58th BFI London Film Festival on 12 October 2014 and was later released theatrically on 30 October 2014 in Hong Kong and 31 October 2014 in China.",
    "country": "Hong Kong",
    "genres": [
      "Action"
    ],
    "likesCount": 211234211,
    "releaseYear": 2014
  },
  {
    "name": "House of Flying Daggers",
    "productionCompany": "Elite Group Enterprises",
    "description": "House of Flying Daggers is a 2004 wuxia romance film directed by Zhang Yimou and starring Andy Lau, Zhang Ziyi and Takeshi Kaneshiro. Unlike other wuxia films, it is more of a love story than purely a martial arts film.",
    "country": "Hong Kong",
    "genres": [
      "Action"
    ],
    "likesCount": 311231,
    "releaseYear": 2004
  },
  {
    "name": "Operation Mekong",
    "productionCompany": "Bona Film Group",
    "description": "Operation Mekong (traditional Chinese: 湄公河行動; simplified Chinese: 湄公河行动; pinyin: Méigōng Hé Xíngdòng; Jyutping: mei4 gung1 ho4 hang4 dung6) is a 2016 Chinese-Hong Kong crime action film directed by Dante Lam and starring Zhang Hanyu and Eddie Peng. The film is based on the 2011 Mekong River massacre. It was released in China on September 30, 2016 and became one of the highest-grossing films in China",
    "country": "China",
    "genres": [
      "Action",
      "War"
    ],
    "likesCount": 1114211,
    "releaseYear": 2011
  },
  {
    "name": "Sword Master",
    "productionCompany": "Film Unlimited Production",
    "description": "Sword Master (Chinese: 三少爺的劍) is a 2016 Chinese 3D martial arts film directed by Derek Yee.[3] The film was released on 2 December 2016.[4] The film made its worldwide and domestic debut at the 11th Rome Film Festival and the 53rd Golden Horse Film Festival respectively. The film tributes to the Shaw Brothers Studio's 1977 film Death Duel.",
    "country": "China",
    "genres": [
      "Action"
    ],
    "likesCount": 31134211,
    "releaseYear": 2016
  },
  {
    "name": "The War Of Loong",
    "productionCompany": "Casey Silver Productions",
    "description": "Directed by Feng Gao. With Qihu An, Yunjin Cao, Denis Chernov, Shaune Diop. The movie is based on a real historic event. During French's invading wa",
    "country": "China",
    "genres": [
      "Action"
    ],
    "likesCount": 3134211,
    "releaseYear": 2017
  },
  {
    "name": "Curse of the Golden Flower",
    "productionCompany": "Casey Silver Productions",
    "description": "Curse of the Golden Flower (Chinese: 满城尽带黄金甲; pinyin: Mǎnchéngjìndàihuángjīnjiǎ) is a 2006 Chinese epic wuxia drama film written and directed by Zhang Yimou. The Mandarin Chinese title of the movie is taken from the last line of the Qi Dynasty poem written by the rebel leader Emperor Huang Chao who was also the Emperor of the Qi Dynasty that was at war against the Later Tang Dynasty.",
    "country": "China",
    "genres": [
      "Action",
      "History",
      "Drama"
    ],
    "likesCount": 34211,
    "releaseYear": 2006
  },
  {
    "name": "Dragon",
    "productionCompany": "We Pictures",
    "description": "Dragon (Chinese: 武俠; pinyin: Wǔ xiá) is a 2011 Hong Kong-Chinese martial arts film directed by Peter Chan, and starring Donnie Yen, Takeshi Kaneshiro and Tang Wei.[7] Yen also served as the film's action director. It premiered on 13 May 2011 at the 2011 Cannes Film Festival in the Midnight Screenings category.[8] Donnie Yen and Peter Chan presided over the lighting of a billboard for Dragon that broke the Guinness Book of World Records for its size, 3591 square metres, previously held by a poster for a Michael Jackson album.",
    "country": "China",
    "genres": [
      "Action"
    ],
    "likesCount": 33112334211,
    "releaseYear": 2011
  },
  {
    "name": "Three Kingdoms: Resurrection of the Dragon",
    "productionCompany": "Visualizer Film Taewon",
    "description": "Three Kingdoms: Resurrection of the Dragon is a 2008 Hong Kong action war drama film loosely based on parts of the 14th-century Chinese classical novel Romance of the Three Kingdoms. It was directed by Daniel Lee with a reported budget of US$25 million. The film is a joint production between Hong Kong, the People's Republic of China and South Korea.",
    "country": "China",
    "genres": [
      "Action",
      "Adventure"
    ],
    "likesCount": 14142414,
    "releaseYear": 2008
  },
  {
    "name": "The White Haired Witch of Lunar Kingdom",
    "productionCompany": "Bona Film Group",
    "description": "The White Haired Witch of Lunar Kingdom is a Chinese wuxia-fantasy 3D film loosely adapted from Liang Yusheng's novel Baifa Monü Zhuan. Directed by Jacob Cheung and produced by Bona Film Group, the film stars Fan Bingbing as the title character, with Huang Xiaoming, Vincent Zhao and others among the supporting cast. Originally scheduled for release on 25 April 2014, the film was moved to 1 August 2014, then moved a day earlier to 31 July 2014.",
    "country": "China",
    "genres": [
      "Action",
      "History"
    ],
    "likesCount": 3234211,
    "releaseYear": 2014
  },
  {
    "name": "Flying Swords of Dragon Gate",
    "productionCompany": "China Film Group Corporation",
    "description": "Flying Swords of Dragon Gate is a 2011 wuxia film directed by Tsui Hark and starring Jet Li, Zhou Xun, Chen Kun, Li Yuchun, Gwei Lun-mei, Louis Fan and Mavis Fan. The film is a remake of Dragon Gate Inn (1966) and New Dragon Gate Inn (1992) but takes place three years after. Production started on 10 October 2010 and is filmed in 3-D.[3] The film screened out of competition at the 62nd Berlin International Film Festival in February 2012.[5] The film received seven nominations at the 2012 Asian Film Awards, including Best Picture and Best Director.[6]",
    "country": "China",
    "genres": [
      "Action",
      "War"
    ],
    "likesCount": 113211231,
    "releaseYear": 2011
  },
  {
    "name": "SPL: Sha Po Lang",
    "productionCompany": "Casey Silver Productions",
    "description": "SPL: Sha Po Lang (Chinese: 殺破狼, released in the United States as Kill Zone) is a 2005 Hong Kong action film written and directed by Wilson Yip, and starring Donnie Yen, Sammo Hung and Simon Yam. The film was released in Hong Kong on 18 November 2005.",
    "country": "China",
    "genres": [
      "Action"
    ],
    "likesCount": 3131313,
    "releaseYear": 2005
  },
  {
    "name": "14 Blades",
    "productionCompany": "Casey Silver Productions",
    "description": "14 Blades is a 2010 wuxia film directed by Daniel Lee, starring Donnie Yen, Zhao Wei, Sammo Hung, Wu Chun, Kate Tsui, Qi Yuwu and Damian Lau. The film was released on 4 February 2010 in China and on 11 February 2010 in Hong Kong.",
    "country": "China",
    "genres": [
      "Action"
    ],
    "likesCount": 441414141,
    "releaseYear": 2010
  },
  {
    "name": "Reign of Assassins",
    "productionCompany": "Lion Rock Productions",
    "description": "Reign of Assassins is a 2010 wuxia film directed by Su Chao-pin and co-directed by John Woo. The film is shot in China and set during the Ming Dynasty. The film stars Michelle Yeoh, who plays an assassin who tries to return to a normal life after being counseled by a monk. After saving her husband and herself from robbers, she attracts the attention of her former assassin gang.",
    "country": "China",
    "genres": [
      "Action",
      "Adventure"
    ],
    "likesCount": 3112342110,
    "releaseYear": 2010
  },
  {
    "name": "Police Story 3: Super Cop",
    "productionCompany": "Media Asia Films",
    "description": "Police Story 3: Super Cop (Chinese: 警察故事３超級警察; Cantonese Yale: gíng chaat gu sih sāam: Chīu kāp gíng chaat), also known as Super Cop in North America, is a 1992 Hong Kong action comedy film starring Jackie Chan and Michelle Yeoh. Jackie reprises his \"Kevin\" Chan Ka-Kui character, a Hong Kong cop from Police Story and Police Story 2. It is the first in the Police Story series not to be directed by Jackie, with Stanley Tong taking over the helm. It is also the last appearance in the series for Maggie Cheung as Jackie's girlfriend, May.",
    "country": "China",
    "genres": [
      "Action"
    ],
    "likesCount": 3131310,
    "releaseYear": 1992
  },
  {
    "name": "The Banquet",
    "productionCompany": "Media Asia Films",
    "description": "RThe Banquet, released on DVD in the United States as Legend of the Black Scorpion, is a 2006 Chinese wuxia drama film. The film was directed by Feng Xiaogang and stars Zhang Ziyi, Ge You, Daniel Wu and Zhou Xun. It is a loose adaption of William Shakespeare's tragedy Hamlet and Henrik Ibsen's play Ghosts, featuring themes of revenge and fate. It is set in the Five Dynasties and Ten Kingdoms period in 10th century China.",
    "country": "China",
    "genres": [
      "Action",
      "Drama"
    ],
    "likesCount": 2424243243,
    "releaseYear": 2006
  },
  {
    "name": "Fist Of Legend",
    "productionCompany": "Eastern Productions",
    "description": "Fist of Legend is a 1994 Hong Kong martial arts film directed by Gordon Chan, featuring action choreography by Yuen Woo-ping, and produced by Jet Li, who also starred in the lead role. The film was released on 22 December 1994.It is a remake of the 1972 film, Fist of Fury, which starred Bruce Lee as the lead character. The film is set in the Shanghai International Settlement in 1914 at the beginning of the First World War as the Imperial Japanese Army are stationed in Shanghai, China. It currently holds a 100% rating on Rotten Tomatoes.",
    "country": "China",
    "genres": [
      "Action"
    ],
    "likesCount": 423442,
    "releaseYear": 1994
  },
  {
    "name": "True Legend",
    "productionCompany": "EDKO Films Ltd",
    "description": "True Legend is a 2010 Chinese martial arts film directed by Yuen Woo-ping, starring Vincent Zhao, Zhou Xun, Jay Chou, Michelle Yeoh, Andy On, David Carradine, Guo Xiaodong, Feng Xiaogang, Cung Le, Gordon Liu, Bryan Leung and Jacky Heung. This was Yuen Woo-ping's first film directing since 1996's Tai Chi Boxer.",
    "country": "China",
    "genres": [
      "Action",
      "History",
      "War"
    ],
    "likesCount": 4242442421,
    "releaseYear": 2010
  },
  {
    "name": "Police Story 2",
    "productionCompany": "Golden Way Films Ltd.",
    "description": "Police Story 2 (Chinese: 警察故事續集, a.k.a. Jackie Chan's Police Story 2) is a 1988 Hong Kong action film written, directed by and starring Jackie Chan as Chan Ka-kui. It is a sequel to the hit 1985 film, Police Story, continuing the storyline of Chan's character, \"Kevin\" Chan Ka-kui.",
    "country": "China",
    "genres": [
      "Action",
      "Adventure"
    ],
    "likesCount": 342110,
    "releaseYear": 1988
  },
  {
    "name": "Once Upon a Time in China II",
    "productionCompany": "Golden Harvest",
    "description": "Once Upon a Time in China II is a 1992 Hong Kong–Chinese martial arts film written and directed by Tsui Hark, and starring Jet Li as Chinese martial arts master and folk hero of Cantonese ethnicity, Wong Fei-hung.[2] It is the second instalment in the Once Upon a Time in China film series. The iconic theme song, A Man Should Better Himself (男兒當自強), was performed in Cantonese by George Lam at the beginning of the film, and by Jackie Chan in the end credits. (Chan also sang the Mandarin version.)",
    "country": "China",
    "genres": [
      "Action"
    ],
    "likesCount": 312110,
    "releaseYear": 1992
  },
  {
    "name": "Fist Of Fury",
    "productionCompany": "Golden Harvest",
    "description": "Fist of Fury (also known as The Chinese Connection) is a 1972 Hong Kong martial arts film directed by Lo Wei, starring Bruce Lee in his second major role after The Big Boss (1971).[1] Lee plays Chen Zhen, a student of Huo Yuanjia, who fights to defend the honor of the Chinese in the face of foreign aggression, and to bring to justice those responsible for his master's death",
    "country": "Hong Kong",
    "genres": [
      "Action"
    ],
    "likesCount": 31110,
    "releaseYear": 1972
  },
  {
    "name": "A Better Tomorrow II",
    "productionCompany": "Cinema City",
    "description": "A Better Tomorrow 2 is a 1987 Hong Kong action film written and directed by John Woo. A follow-up to its popular predecessor, A Better Tomorrow, the film stars returning cast members Chow Yun-fat, Ti Lung and Leslie Cheung alongside new cast member Dean Shek. The film was released in Hong Kong on 17 December 1987.",
    "country": "Hong Kong",
    "genres": [
      "Action"
    ],
    "likesCount": 34414110,
    "releaseYear": 1987
  },
  {
    "name": "Fighting",
    "productionCompany": "Lion Rock Productions",
    "description": "Fighting (Chinese: 英雄之战) is a 2014 Chinese action-romance film directed by Yu Junhao and starring Lu Yi, Peter Ho, Wei Yi and Zhang Zhikang. The film was released on March 21, 2014",
    "country": "China",
    "genres": [
      "Action",
      "Crime"
    ],
    "likesCount": 42424234,
    "releaseYear": 2014
  },
  {
    "name": "Come Drink with Me",
    "productionCompany": "Shaw Brothers Studio",
    "description": "Come Drink with Me is a 1966 Hong Kong wuxia film directed by King Hu. Set during the Ming Dynasty, it stars Cheng Pei-pei and Yueh Hua as warriors with Chan Hung-lit as the villain, and features action choreography by Han Ying-chieh. It is widely considered one of the best Hong Kong films ever made.[1][unreliable source] The film was selected as the Hong Kong entry for the Best Foreign Language Film at the 39th Academy Awards, but was not nominated.",
    "country": "Hong Kong",
    "genres": [
      "Action"
    ],
    "likesCount": 54355345,
    "releaseYear": 1996
  },
  {
    "name": "One-Armed Swordsman",
    "productionCompany": "Shaw Brothers Studio",
    "description": "One-Armed Swordsman is a 1967 Hong Kong wuxia film produced by the Shaw Brothers Studio.[1] Directed by Chang Cheh, it was the first of the new style of wuxia films emphasizing male anti-heroes, violent swordplay and heavy bloodletting. It was the first Hong Kong film to make HK$1 million at the local box office, propelling its star Jimmy Wang to super stardom.",
    "country": "Hong Kong",
    "genres": [
      "Action"
    ],
    "likesCount": 342110,
    "releaseYear": 1967
  },
  {
    "name": "Devil and Angel",
    "productionCompany": "Tianjin Chengzi Yingxiang Media",
    "description": "Two exact opposite personalities (Mo Feili, a hooligan debt collector, and Zha Xiaodao, a neurotic rule-obsessed accountant/PhD) are teamed up by a scheming guru, who has been cheating the collector. When they collect 3.2 million yuan they find themselves in trouble and have to deal with the differences between them to work together and find a place for themselves in the world.",
    "country": "China",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "likesCount": 3131313,
    "releaseYear": 2015
  },
  {
    "name": "Lost in Thailand",
    "productionCompany": "YYT Media",
    "description": "Lost in Thailand is a 2012 Chinese comedy film directed and co-written by Xu Zheng and starring Xu Zheng, Wang Baoqiang, and Huang Bo. The film is about three Chinese men traveling in Thailand: two competing scientists searching for their boss, and a tourist eager to explore the country.[3] The film is Xu's directorial debut.",
    "country": "China",
    "genres": [
      "Comedy"
    ],
    "likesCount": 5353535,
    "releaseYear": 2012
  },
  {
    "name": "Flirting Scholar 2",
    "productionCompany": "Lion Rock Productions",
    "description": "Flirting Scholar 2 (simplified Chinese: 唐伯虎点秋香2之四大才子; traditional Chinese: 唐伯虎點秋香2之四大才子; pinyin: Táng Bóhǔ diǎn Qiūxiāng èr zhi Sì Dà Cáizǐ; Jyutping: tong4 baak3 fu2 dim2 cau1 heong1 ji6 zi1 sei3 daai6 coi4 zi2) is a 2010 Chinese comedy film directed by Hong Kong director Lee Lik-Chi and starring Huang Xiaoming, Zhang Jingchu, Natalis Chan, Zhou Libo and Richie Ren. It is a prequel to the 1993 Hong Kong film Flirting Scholar which starred Stephen Chow and also directed by Lee.",
    "country": "China",
    "genres": [
      "Comedy"
    ],
    "likesCount": 3112342110,
    "releaseYear": 2010
  },
  {
    "name": "Unforgettable Blast",
    "productionCompany": "ShamRock Productions",
    "description": "Unforgettable Blast (Chinese: 迷与狂) is a 2015 Chinese comedy film directed by Yan Tinglu. It was released in China on May 22, 2015.",
    "country": "China",
    "genres": [
      "Comedy",
      "Teen Movie"
    ],
    "likesCount": 34234242,
    "releaseYear": 2015
  },
  {
    "name": "Old Boys: The Way of the Dragon",
    "productionCompany": "LeVision Pictures",
    "description": "Old Boys: The Way of the Dragon (Chinese: 老男孩猛龙过江) is a 2014 Chinese comedy film directed by the Chopstick Brothers (Xiao Yang and Wang Taili) and starring Chopstick Brothers, Qu Jingjing and Wanting Qu. It was released on 10 July 2014.",
    "country": "China",
    "genres": [
      "Action",
      "Comedy"
    ],
    "likesCount": 54353554,
    "releaseYear": 2014
  },
  {
    "name": "I Am Not Madame Bovary",
    "productionCompany": "Beijing Skywheel Entertainment",
    "description": "I Am Not Pan Jinlian (Chinese: 我不是潘金莲 or Chinese: 我叫李雪莲), better known as I Am Not Madame Bovary, is a 2016 Chinese comedy film directed by Feng Xiaogang and written by Liu Zhenyun, based on Liu's 2012 novel \"I Did Not Kill My Husband\".[5] The film stars Fan Bingbing, Zhang Jiayi, Yu Hewei, Dong Chengpeng and Guo Tao. It was selected to be screened in the Special Presentations section at the 2016 Toronto International Film Festival. and won the award for Best Achievement in Directing (Feng Xiaogang) at the Asia Pacific Screen Awards. It was released in China on 18 November 2016.",
    "country": "China",
    "genres": [
      "Comedy",
      "Drama"
    ],
    "likesCount": 52424242,
    "releaseYear": 2016
  },
  {
    "name": "Personal Tailor",
    "productionCompany": "Huayi Brothers\n",
    "description": "A story centered on a company that grants wishes to people looking for a day away from their ordinary lives.",
    "country": "China",
    "genres": [
      "Comedy",
      "Adventure"
    ],
    "likesCount": 66464646,
    "releaseYear": 2013
  },
  {
    "name": "Foolish Plans",
    "productionCompany": "Shanghai Huada Pictures",
    "description": "Foolish Plans is a 2016 Chinese adventure comedy film directed by Jiang Tao and starring Wang Ning, Xiu Rui, Wang Zijian, Wang Ou, Liu Yase and Chen Yang. It was released in China by Beijing Juhe Yinglian Media and in North America by United Entertainment Partners on July 8, 2016.",
    "country": "China",
    "genres": [
      "Comedy"
    ],
    "likesCount": 5242424,
    "releaseYear": 2016
  },
  {
    "name": "A Fish Called Wanda",
    "productionCompany": "United International Pictures",
    "description": "A black comedy film starring John Cleese and Michael Palin. A con artist uses her female charms to steal a stash of jewels.",
    "country": "United Kingdom",
    "genres": [
      "Comedy",
      "Adventure"
    ],
    "likesCount": 13131312,
    "releaseYear": 1988
  },
  {
    "name": "Bean - The Ultimate Disaster Movie",
    "productionCompany": "Working Title Films",
    "description": "1997 British comedy film. Stars Rowan Atkinson, Peter MacNicol, Pamela Reed, Harris Yulin, Burt Reynolds, Larry Drake, Chris Ellis, Johnny Galecki and others.",
    "country": "United Kingdom",
    "genres": [
      "Comedy"
    ],
    "likesCount": 2424242424,
    "releaseYear": 1997
  },
  {
    "name": "Carry On Camping",
    "productionCompany": "Peter Rogers Productions",
    "description": "R1969 British comedy film about antics on a camp site. Stars Sid James, Charles Hawtrey, Joan Sims, Kenneth Williams, Terry Scott and others..",
    "country": "United Kingdom",
    "genres": [
      "Comedy",
      "Adventure"
    ],
    "likesCount": 4242424,
    "releaseYear": 1969
  },
  {
    "name": "Fierce Creatures",
    "productionCompany": "Universal Pictures",
    "description": "John Cleese leads the staff (and animals!) of an English zoo under threat from a heartless global corporation. A sort-of sequel to A Fish Called Wanda",
    "country": "United Kingdom",
    "genres": [
      "Comedy"
    ],
    "likesCount": 4423223,
    "releaseYear": 1997
  },
  {
    "name": "Carry On... Up The Khyber",
    "productionCompany": "Peter Rogers Productions",
    "description": "Sir Sidney Ruff-Diamond is in charge of the motley kilted crew of the Third Foot and Mouth regiment at a British outpost in the Khyber Pass.",
    "country": "United Kingdom",
    "genres": [
      "Comedy",
      "Adventure"
    ],
    "likesCount": 313131232,
    "releaseYear": 1968
  },
  {
    "name": "Monty Python's Life Of Brian",
    "productionCompany": "Hand Made Films",
    "description": "Biblical movie satire focusing on the life of Brian Cohen, a man born into Roman-occupied Judea who reluctantly finds himself mistaken for the Messiah.",
    "country": "United Kingdom",
    "genres": [
      "Comedy",
      "History"
    ],
    "likesCount": 53535353,
    "releaseYear": 1979
  },
  {
    "name": "Notting Hill",
    "productionCompany": "Universal Prictures",
    "description": "Romantic comedy film about the relationship between a famous American movie actress and an unassuming British book shop owner.",
    "country": "United Kingdom",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "likesCount": 3342110,
    "releaseYear": 1999
  },
  {
    "name": "The Ladykillers",
    "productionCompany": "Ealing Studios",
    "description": "Classic Ealing comedy film starring Alec Guinness and Peter Sellers. A gang of robbers meet their match in a little old lady.",
    "country": "United Kingdom",
    "genres": [
      "Comedy",
      "Thriller"
    ],
    "likesCount": 63636346,
    "releaseYear": 1955
  },
  {
    "name": "Withnail & I",
    "productionCompany": "Handmade Films",
    "description": "1987 British comedy film about a squalid, wet holiday. Stars Paul McGann, Richard E. Grant, Richard Griffiths, Ralph Brown, Michael Elphick and others..",
    "country": "United Kingdom",
    "genres": [
      "Comedy",
      "Thriller"
    ],
    "likesCount": 3112342110,
    "releaseYear": 1987
  },
  {
    "name": "Meet the Parents",
    "productionCompany": "Universal Pictures",
    "description": "Astutely observed, subtly played and consistently hilarious, this family farce marks a change of pace for Austin Powers director Roach, who directs his perfectly matched stars, De Niro and Stiller, with a keen eye for comically exaggerated yet instantly recognisable human behaviour.",
    "country": "United States",
    "genres": [
      "Comedy"
    ],
    "likesCount": 342110,
    "releaseYear": 1992
  },
  {
    "name": "Balls of Fury",
    "productionCompany": "Spyglass Entertainment",
    "description": "Balls of Fury is a 2007 American sports comedy film directed by Ben Garant. It stars Dan Fogler, George Lopez, Christopher Walken, and Maggie Q. The film was released in the United States on August 29, 2007.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Sport"
    ],
    "likesCount": 52522525,
    "releaseYear": 2007
  },
  {
    "name": "Dan in Real Life",
    "productionCompany": "Waltdisney",
    "description": "Dan in Real Life is a 2007 American comedy-drama film directed by Peter Hedges, and stars Steve Carell, Alison Pill, Juliette Binoche, Dianne Wiest, John Mahoney and Dane Cook.",
    "country": "United States",
    "genres": [
      "Comedy"
    ],
    "likesCount": 63636346,
    "releaseYear": 2007
  },
  {
    "name": "Hot Rod",
    "productionCompany": "Paramount Pictures",
    "description": "Hot Rod is a 2007 American comedy film co-written, directed by, and starring members of The Lonely Island (Andy Samberg, Jorma Taccone and Akiva Schaffer). The film stars Samberg as amateur stuntman Rod Kimble, whose step-father, Frank (Ian McShane) continuously mocks and disrespects him. When Frank becomes ill, Rod raises money for his heart operation by executing his largest stunt yet. In addition to raising money for the operation, he also does so to win Frank's respect, by kicking his butt. The film also stars Taccone, Sissy Spacek, Will Arnett, Danny McBride, Isla Fisher and Bill Hader. It was directed by Schaffer (in his directorial debut) and distributed by Paramount Pictures.",
    "country": "United States",
    "genres": [
      "Comedy"
    ],
    "likesCount": 3110,
    "releaseYear": 2007
  },
  {
    "name": "License to Wed",
    "productionCompany": "Robert Simonds Productions",
    "description": "License to Wed is a 2007 American romantic comedy film starring Robin Williams, Mandy Moore and John Krasinski, and directed by Ken Kwapis. The film was released in theaters on July 3, 2007.",
    "country": "United States",
    "genres": [
      "Comedy"
    ],
    "likesCount": 3342110,
    "releaseYear": 2007
  },
  {
    "name": "American Pie Presents: Beta House",
    "productionCompany": "Universal Pictures",
    "description": "American Pie Presents: Beta House is a 2007 American sex comedy film released by Universal Pictures. It is the third installment in American Pie Presents film series, a spin-off of the American Pie franchise and the sequel to 2006's The Naked Mile, and the sixth installment overall. John White stars as Erik Stifler, a college freshman who pledges the Beta House fraternity led by his cousin Dwight Stifler (Steve Talley). Christopher McDonald co-stars as Erik's father and Eugene Levy plays Beta House alumnus Noah Levenstein.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Teen Movie"
    ],
    "likesCount": 234242424,
    "releaseYear": 2008
  },
  {
    "name": "Extreme Movie",
    "productionCompany": "FlipZide Pictures",
    "description": "Extreme Movie (formerly Parental Guidance Suggested; known as Hotdogs & Doughnuts: An Extreme Movie in Australia) is a 2008 American satirical comedy film composed of sketches focusing on teen sex. Adam Jay Epstein and Andrew Jacobson direct, with segments co-written by Saturday Night Live performers Will Forte, Andy Samberg, and writers Akiva Schaffer, Jorma Taccone, Phil Lord and Christopher Miller. The ensemble cast includes Frankie Muniz, Ryan Pinkston, Jamie Kennedy, Danneel Harris, Andy Milonakis, Matthew Lillard, Rob Pinkston and Michael Cera.",
    "country": "United States",
    "genres": [
      "Comedy"
    ],
    "likesCount": 242424234,
    "releaseYear": 2008
  },
  {
    "name": "Harold & Kumar Escape from Guantanamo Bay",
    "productionCompany": "Kingsgate Films",
    "description": "Harold & Kumar Escape from Guantanamo Bay is a 2008 American stoner comedy film, and the second installment of the Harold & Kumar series. The film was written and directed by Jon Hurwitz and Hayden Schlossberg.",
    "country": "United States",
    "genres": [
      "Comedy"
    ],
    "likesCount": 332123123110,
    "releaseYear": 2008
  },
  {
    "name": "Run Fatboy Run",
    "productionCompany": "Newline Cinema",
    "description": "Run Fatboy Run is a 2007 British-American comedy film directed by David Schwimmer, written by Michael Ian Black and Simon Pegg, and starring Pegg, Dylan Moran, Thandie Newton, Harish Patel, India de Beaufort, and Hank Azaria. It was released in the United Kingdom on 7 September 2007, in Canada on 10 September 2007, and in the United States on 28 March 2008.",
    "country": "United States",
    "genres": [
      "Comedy"
    ],
    "likesCount": 332110,
    "releaseYear": 2008
  },
  {
    "name": "Step Brothers",
    "productionCompany": "Relativity Media",
    "description": "Step Brothers is a 2008 American comedy film directed by Adam McKay and written by Will Ferrell and McKay from a story by Ferrell, McKay, and John C. Reilly. It follows Brennan (Ferrell) and Dale (Reilly), two grown men who are forced to live together as brothers after their single parents marry each other. Richard Jenkins, Mary Steenburgen, Adam Scott and Kathryn Hahn also star.",
    "country": "United States",
    "genres": [
      "Comedy"
    ],
    "likesCount": 332110,
    "releaseYear": 2008
  },
  {
    "name": "Tropic Thunder",
    "productionCompany": "DreamWorks Pictures",
    "description": "Tropic Thunder is a 2008 action comedy film directed by Ben Stiller. It stars Stiller, Jack Black, Robert Downey Jr., Jay Baruchel and Brandon T. Jackson as a group of prima donna actors who are making a Vietnam War film. When their frustrated director (played by Steve Coogan) drops them in the middle of a jungle, they are forced to rely on their acting skills to survive the real action and danger. The screenplay by Justin Theroux, Stiller, and Etan Cohen was from a story by Stiller and Theroux. The film was produced by Stuart Cornfeld, Stiller and Eric McLeod for Red Hour Productions and DreamWorks Pictures as an international co-production between the United States, Germany and the United Kingdom.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Thriller",
      "Adventure"
    ],
    "likesCount": 444141,
    "releaseYear": 2008
  },
  {
    "name": "Superhero Movie",
    "productionCompany": "Dimenstions Films",
    "description": "Superhero Movie is a 2008 American superhero comedy film written and directed by Craig Mazin, produced by Robert K. Weiss and David Zucker, and starring Drake Bell, Sara Paxton, Christopher McDonald, and Leslie Nielsen. It was originally titled Superhero! as a nod to one of the Zuckers' previous films, Airplane!, in which Nielsen also starred.",
    "country": "United States",
    "genres": [
      "Comedy"
    ],
    "likesCount": 44414131,
    "releaseYear": 2008
  },
  {
    "name": "17 Again",
    "productionCompany": "Offspring Entertainment",
    "description": "17 Again is a 2009 American comedy film directed by Burr Steers. The film follows 37-year-old Mike (Matthew Perry) who becomes his 17-year-old self (Zac Efron) after a chance accident. The film also features Leslie Mann, Thomas Lennon and Michelle Trachtenberg in supporting roles. The film was released in the United States on April 17, 2009.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "likesCount": 2424242424,
    "releaseYear": 2009
  },
  {
    "name": "Couples Retreat",
    "productionCompany": "Wild West Picture Show",
    "description": "Couples Retreat is a 2009 American romantic comedy film directed by Peter Billingsley marking his directorial debut, and written by Jon Favreau, Vince Vaughn, Dana Fox, Curtis Hanson, and Greg Beeman. Vaughn and Favreau star with Jason Bateman, Faizon Love, Kristin Davis, Malin Åkerman, Kristen Bell, and Jean Reno. It was released on October 9, 2009, in the United States. The film was shot mostly on the French Polynesian island of Bora Bora.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Adventure"
    ],
    "likesCount": 4242424,
    "releaseYear": 2009
  },
  {
    "name": "Fired Up!",
    "productionCompany": "Screen Gems",
    "description": "Fired Up! is a 2009 American teen comedy film directed by Will Gluck, who is also credited with writing the movie under the pseudonym Freedom Jones. The main plot revolves around two popular high school student football players (portrayed by Eric Christian Olsen and Nicholas D'Agosto) who attend a cheerleading camp for the summer to get close to its 300 female cheerleaders.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Sport",
      "Romance"
    ],
    "likesCount": 6634634636,
    "releaseYear": 2009
  },
  {
    "name": "The Hangover",
    "productionCompany": "Greenhat Films",
    "description": "The Hangover is a 2009 American comedy film directed by Todd Phillips, co-produced with Daniel Goldberg, and written by Jon Lucas and Scott Moore. It is the first installment in The Hangover trilogy. The film stars Bradley Cooper, Ed Helms, Zach Galifianakis, Heather Graham, Justin Bartha, and Jeffrey Tambor. It tells the story of Phil Wenneck, Stu Price, Alan Garner, and Doug Billings, who travel to Las Vegas for a bachelor party to celebrate Doug's impending marriage. However, Phil, Stu, and Alan wake up with Doug missing and no memory of the previous night's events, and must find the groom before the wedding can take place.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Adventure"
    ],
    "likesCount": 444141424243,
    "releaseYear": 2009
  },
  {
    "name": "Miss March",
    "productionCompany": "DreamWorks Pictures",
    "description": "Miss March is a 2009 comedy film directed by and starring Trevor Moore and Zach Cregger, stars of the IFC show The Whitest Kids U' Know. The film was released in the United States on March 13, 2009.",
    "country": "United States",
    "genres": [
      "Comedy"
    ],
    "likesCount": 4441413131,
    "releaseYear": 2009
  },
  {
    "name": "Paper Heart",
    "productionCompany": "Paperture Pictures",
    "description": "Paper Heart is a 2009 American romantic comedy film starring Charlyne Yi and Michael Cera as fictionalized versions of themselves based on their rumored relationship, though Yi has said they never dated.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Documentary"
    ],
    "likesCount": 44,
    "releaseYear": 2009
  },
  {
    "name": "Post Grad",
    "productionCompany": "FoxAtomic",
    "description": "Post Grad is a 2009 American independent romantic comedy film directed by Vicky Jenson and starring Alexis Bledel,[3] about a recent college graduate who moves back in with her family while she figures out what she wants to do next.",
    "country": "United States",
    "genres": [
      "Comedy"
    ],
    "likesCount": 42424243141,
    "releaseYear": 2009
  },
  {
    "name": "Land of the Lost",
    "productionCompany": "Relativity Media",
    "description": "Land of the Lost is a 2009 American adventure comedy film directed by Brad Silberling, written by Chris Henchy and Dennis McNicholas and starring Will Ferrell, Danny McBride and Anna Friel, loosely based on the 1974 Sid and Marty Krofft television series of the same name. The film was theatrically released on June 5, 2009 by Universal Pictures.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Adventure"
    ],
    "likesCount": 757575756,
    "releaseYear": 2009
  },
  {
    "name": "Death at a Funeral",
    "productionCompany": "Wonderful Films",
    "description": "Death at a Funeral is a 2010 American ensemble comedy film directed by Neil LaBute with a screenplay by Dean Craig based on the 2007 British film of the same name that Craig also wrote. Peter Dinklage is the only actor returning in the remake.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Mystery"
    ],
    "likesCount": 4441414242424,
    "releaseYear": 2010
  },
  {
    "name": "Gulliver's Travels",
    "productionCompany": "Davis Entertainment Company",
    "description": "Gulliver's Travels is a 2010 American fantasy adventure comedy film directed by Rob Letterman, produced by John Davis and Gregory Goodman, written by Joe Stillman and Nicholas Stoller with music by Henry Jackman but very loosely based on the first two parts of the 18th-century satire of the same name by Jonathan Swift; film takes place in the modern day. It stars Jack Black, Jason Segel, Emily Blunt, Amanda Peet, Billy Connolly, T. J. Miller, Chris O'Dowd, James Corden, and Catherine Tate and is distributed by 20th Century Fox. The film was theatrically released on December 25, 2010 in the US. The film earned $237.4 million on a $112 million budget. Gulliver's Travels was released on DVD and Blu-ray Disc on April 19, 2011, by 20th Century Fox Home Entertainment.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Adventure"
    ],
    "likesCount": 66363636,
    "releaseYear": 2010
  },
  {
    "name": "She's Out of My League",
    "productionCompany": "DreamWorks Pictures",
    "description": "She's Out of My League is a 2010 American romantic comedy film directed by Jim Field Smith and written by Sean Anders and John Morris. The film stars Jay Baruchel and Alice Eve, and was produced by Jimmy Miller and David Householter for Paramount Pictures and DreamWorks Pictures and filmed in Pittsburgh, Pennsylvania. Production on the film finished in 2008. The film received its wide theatrical release on March 12, 2010. It is the first feature film directed by Smith.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "likesCount": 525235252,
    "releaseYear": 2010
  },
  {
    "name": "Crazy, Stupid, Love",
    "productionCompany": "Di Novi Pictures",
    "description": "Crazy, Stupid, Love. is a 2011 American romantic comedy film directed by Glenn Ficarra and John Requa, written by Dan Fogelman, and starring Steve Carell, Ryan Gosling, Julianne Moore, Emma Stone, Marisa Tomei and Kevin Bacon. It follows a recently divorced man who seeks to rediscover his manhood and is taught how to pick up women at bars.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Romance"
    ],
    "likesCount": 52525252523,
    "releaseYear": 2010
  },
  {
    "name": "Hall Pass",
    "productionCompany": "Newline Cinema",
    "description": "Hall Pass is a 2011 American comedy film produced and directed by the Farrelly brothers and co-written by them along with Pete Jones,[3] the writer/director of Stolen Summer. It stars Owen Wilson and Jason Sudeikis.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Adventure"
    ],
    "likesCount": 242423423,
    "releaseYear": 2010
  },
  {
    "name": "The Hangover Part II",
    "productionCompany": "Legendary Pictures",
    "description": "The Hangover Part II is a 2011 American comedy film produced by Legendary Pictures and distributed by Warner Bros. Pictures. It is the sequel to the 2009 film The Hangover and the second installment in The Hangover trilogy. Directed by Todd Phillips, who co-wrote the script with Craig Mazin and Scot Armstrong, the film stars Bradley Cooper, Ed Helms, Zach Galifianakis, Ken Jeong, Jeffrey Tambor, Justin Bartha, and Paul Giamatti. It tells the story of Phil, Stu, Alan, and Doug as they travel to Thailand for Stu's wedding. After the bachelor party in Las Vegas, Stu takes no chances and opts for a safe, subdued pre-wedding brunch. Things do not go as planned, resulting in another bad hangover with no memories of the previous night.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Thriller",
      "Adventure"
    ],
    "likesCount": 4424242424,
    "releaseYear": 2010
  },
  {
    "name": "Horrible Bosses",
    "productionCompany": "Rat Entertainment",
    "description": "Horrible Bosses is a 2011 American black comedy film directed by Seth Gordon, written by Michael Markowitz, John Francis Daley, and Jonathan Goldstein, based on a story by Markowitz. It stars Jason Bateman, Charlie Day, Jason Sudeikis, Jennifer Aniston, Colin Farrell, Kevin Spacey, and Jamie Foxx. The plot follows three friends, played by Bateman, Day, and Sudeikis, who decide to murder their respective overbearing, abusive bosses, portrayed by Spacey, Aniston, and Farrell.",
    "country": "United States",
    "genres": [
      "Comedy",
      "Thriller",
      "Adventure"
    ],
    "likesCount": 444141,
    "releaseYear": 2011
  }
]